In [ ]:
# Create the Data frame using  dict - names - age

In [1]:
import pandas as pd
import datetime as dt

In [2]:
dict = {"name":["A Alex","T Dushyanth","C raju"],"age" : [18,30,40]}
df= pd.DataFrame(dict)
df

          name  age
0       A Alex   18
1  T Dushyanth   30
2       C raju   40

In [4]:
df.to_dict('list')

{'name': ['A Alex', 'T Dushyanth', 'C raju'], 'age': [18, 30, 40]}

In [7]:
col=['name','age']
values=[['A Alex',18],['T Dushyanth',30],['C raju',40]]
df=pd.DataFrame(values,columns=col)
df

          name  age
0       A Alex   18
1  T Dushyanth   30
2       C raju   40

In [10]:
df.values.tolist()

[['A Alex', 18], ['T Dushyanth', 30], ['C raju', 40]]

In [22]:
df['first']= df.name.str.extract('([a-zA_Z])',expand=False)
df['last'] = df.name.str.extract('([a-zA_Z])',expand=False)
df

          name  age first last
0       A Alex   18     A    A
1  T Dushyanth   30     u    u
2       C raju   40     r    r

In [18]:
dt.date(2024,11,10)

datetime.date(2024, 11, 10)

In [23]:
df.drop(labels=['first','last'],axis=True,inplace=True)
df

          name  age
0       A Alex   18
1  T Dushyanth   30
2       C raju   40

In [25]:
df['weight'] = [50,70,60]
df['height'] = [150,170,160]
df

          name  age  weight  height
0       A Alex   18      50     150
1  T Dushyanth   30      70     170
2       C raju   40      60     160

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   weight  3 non-null      int64
 3   height  3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

bmi= w/h^2

In [27]:
def BMI(w,h):
    b=w/(h*10^(-2))^2
    return b

In [29]:
df['BMI']= df.weight/(df.height*0.01)^2

TypeError: Cannot perform 'xor' with a dtyped [float64] array and scalar of type [bool]

In [33]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,NaN,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [34]:
# Replace missing values in Min.Price and Max.Price columns with their respective mean.
df['Min.Price'].fillna(df['Min.Price'].mean(),inplace=True)
df['Max.Price'].fillna(df['Max.Price'].mean(),inplace=True)

C:\Users\dushy\AppData\Local\Temp\ipykernel_15164\3806355363.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Min.Price'].fillna(df['Min.Price'].mean(),inplace=True)
C:\Users\dushy\AppData\Local\Temp\ipykernel_15164\3806355363.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Max.Price'].fillna(df['Max.Price'].mean(),inplace=True)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Manufacturer        89 non-null     object
 1   Model               92 non-null     object
 2   Type                90 non-null     object
 3   Min.Price           93 non-null     float64
 4   Price               91 non-null     float64
 5   Max.Price           93 non-null     float64
 6   MPG.city            84 non-null     float64
 7   MPG.highway         91 non-null     float64
 8   AirBags             55 non-null     object
 9   DriveTrain          86 non-null     object
 10  Cylinders           88 non-null     object
 11  EngineSize          91 non-null     float64
 12  Horsepower          86 non-null     float64
 13  RPM                 90 non-null     float64
 14  Rev.per.mile        87 non-null     float64
 15  Man.trans.avail     88 non-null     object
 16  Fuel.tank.capacity  85 non-null     float64
 17  Passengers          91 non-null     float64
 18  Length              89 non-null     float64
 19  Wheelbase           92 non-null     float64
 20  Width               87 non-null     float64
 21  Turn.circle         88 non-null     float64
 22  Rear.seat.room      89 non-null     float64
 23  Luggage.room        74 non-null     float64
 24  Weight              86 non-null     float64
 25  Origin              88 non-null     object
 26  Make                90 non-null     object
dtypes: float64(18), object(9)
memory usage: 19.7+ KB

In [36]:
dict = {"name":["A Alex","T Dushyanth","C raju"],"age" : [18,30,40]}
df= pd.DataFrame(dict)
df

          name  age
0       A Alex   18
1  T Dushyanth   30
2       C raju   40

In [37]:
df.loc[len(df)]=['VARMA',21]

In [38]:
df

          name  age
0       A Alex   18
1  T Dushyanth   30
2       C raju   40
3        VARMA   21

In [42]:
df2=pd.DataFrame({'name':['karma'],'age':[25]})

In [43]:
pd.concat([df,df2],axis=0)

          name  age
0       A Alex   18
1  T Dushyanth   30
2       C raju   40
3        VARMA   21
0        karma   25

In [45]:
# Create the first DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32]
})

# Create the second DataFrame
df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 80000, 65000, 72000]
})

In [46]:
# Display the DataFrames
print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   ID     Name  Age
0   1    Alice   24
1   2      Bob   27
2   3  Charlie   22
3   4    David   32

DataFrame 2:
   ID         City  Salary
0   3     New York   70000
1   4  Los Angeles   80000
2   5      Chicago   65000
3   6      Houston   72000

In [54]:
#inner join
pd.merge(df1,df2,on='ID')

   ID     Name  Age         City  Salary
0   3  Charlie   22     New York   70000
1   4    David   32  Los Angeles   80000

In [57]:
pd.merge(df1,df2,how='outer',on='ID',)

   ID     Name   Age         City   Salary
0   1    Alice  24.0          NaN      NaN
1   2      Bob  27.0          NaN      NaN
2   3  Charlie  22.0     New York  70000.0
3   4    David  32.0  Los Angeles  80000.0
4   5      NaN   NaN      Chicago  65000.0
5   6      NaN   NaN      Houston  72000.0

In [ ]:
df[]